import React from 'react'
import style from '../css/Footer.module.css'

export default function Footer() {
    return (
        <div className={style.container}>
            <div className={style.changeCountry}>
                <div className={style.changeCountryHeader}>
                    Змінити країну
                </div>
                <div className={style.changeCountryButton}>
                    <a href="#"> porsche.com </a>
                </div>
            </div>
            <div className={style.infoContainer}>
                <div className={`${style.text1} ${style.text}`}>
                    © 2024 ТОВ «Віннер Імпортс, ЛТД». Правова інформація. <a href="#"> Політика конфіденційності, </a> <a href="#"> Сookie та соціальні плагіни </a>
                </div>
                <div className={`${style.text2} ${style.text}`}>
                    * Вартість автомобіля вказана для базової комплектації без урахування вартості додаткового обладнання. Вартість розрахована станом на 04.12.2024 року за курсом, розміщеним на сайті winner.ua. Наданий розрахунок є попереднім та вимагає уточнення у офіційних дилерів Porsche в Україні. Остаточна вартість автомобіля вказується у договорі купівлі-продажу на дату підписання договору про придбання автомобіля.
                </div>
                <div className={`${style.text3} ${style.text}`}>
                    ** Дані витрат пального визначені методом Євро-6 (715/2007/ЄС, 195/2013/ЄС та ECE-R 101.01) у циклі NEDC (європейський їздовий цикл). Дані не відносяться до окремого автомобіля і не є частиною пропозиції, а служать лише для порівняння різних типів автомобілів. Реальні показники витрати палива, рівню викидів CO2 та потужності можуть відрізнятися від вказаних в залежності від додаткового обладнання, яке використовується у автомобілі, якості дорожнього покриття, якості палива, манери керування автомобілем та інших не технічних параметрів. Додаткову інформацію можна дізнатись у офіційних дилерів Porsche в Україні.
                </div>
                <div className={`${style.text4} ${style.text}`}>
                    *** Важливі вказівки щодо електроприводних моделей Porsche розміщені <a href="#"> тут </a> .
                </div>
                <div className={`${style.text5} ${style.text}`}>
                    Інформація на сайті porsche.ua надається з метою попереднього ознайомлення та вимагає уточнення у офіційних дилерів Porsche в Україні. Помилки та неповнота інформації на сайті porsche.ua допускаються. Власник сайту має право вносити зміни на свій розсуд, без попереднього погодження з користувачем.
                </div>
            </div>
        </div>
    )
}

// все ссылки это отбельные страници должны быть
